layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 299
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 32
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 299
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 32
    backend: LMDB
  }
}
layer {
  name: "stem_conv1_3x3"
  type: "Convolution"
  bottom: "data"
  top: "stem_conv1_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_conv1_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_conv1_3x3"
  top: "stem_conv1_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_conv1_3x3"
  top: "stem_conv1_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_conv1_3x3_relu"
  type: "ReLU"
  bottom: "stem_conv1_3x3"
  top: "stem_conv1_3x3"
}
layer {
  name: "stem_conv2_3x3"
  type: "Convolution"
  bottom: "stem_conv1_3x3"
  top: "stem_conv2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_conv2_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_conv2_3x3"
  top: "stem_conv2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_conv2_3x3"
  top: "stem_conv2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_conv2_3x3_relu"
  type: "ReLU"
  bottom: "stem_conv2_3x3"
  top: "stem_conv2_3x3"
}
layer {
  name: "stem_conv3_3x3"
  type: "Convolution"
  bottom: "stem_conv2_3x3"
  top: "stem_conv3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_conv3_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_conv3_3x3"
  top: "stem_conv3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_conv3_3x3"
  top: "stem_conv3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_conv3_3x3_relu"
  type: "ReLU"
  bottom: "stem_conv3_3x3"
  top: "stem_conv3_3x3"
}
layer {
  name: "stem_inception1_pool"
  type: "Pooling"
  bottom: "stem_conv3_3x3"
  top: "stem_inception1_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "stem_inception1_conv_3x3"
  type: "Convolution"
  bottom: "stem_conv3_3x3"
  top: "stem_inception1_conv_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception1_conv_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_inception1_conv_3x3"
  top: "stem_inception1_conv_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception1_conv_3x3"
  top: "stem_inception1_conv_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception1_conv_3x3_relu"
  type: "ReLU"
  bottom: "stem_inception1_conv_3x3"
  top: "stem_inception1_conv_3x3"
}
layer {
  name: "stem_inception1_concat"
  type: "Concat"
  bottom: "stem_inception1_pool"
  bottom: "stem_inception1_conv_3x3"
  top: "stem_inception1_concat"
}
layer {
  name: "stem_inception2_conv1_1_1x1"
  type: "Convolution"
  bottom: "stem_inception1_concat"
  top: "stem_inception2_conv1_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception2_conv1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "stem_inception2_conv1_1_1x1"
  top: "stem_inception2_conv1_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception2_conv1_1_1x1"
  top: "stem_inception2_conv1_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception2_conv1_1_1x1_relu"
  type: "ReLU"
  bottom: "stem_inception2_conv1_1_1x1"
  top: "stem_inception2_conv1_1_1x1"
}
layer {
  name: "stem_inception2_conv1_2_3x3"
  type: "Convolution"
  bottom: "stem_inception2_conv1_1_1x1"
  top: "stem_inception2_conv1_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception2_conv1_2_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_inception2_conv1_2_3x3"
  top: "stem_inception2_conv1_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception2_conv1_2_3x3"
  top: "stem_inception2_conv1_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception2_conv1_2_3x3_relu"
  type: "ReLU"
  bottom: "stem_inception2_conv1_2_3x3"
  top: "stem_inception2_conv1_2_3x3"
}
layer {
  name: "stem_inception2_conv2_1_1x1"
  type: "Convolution"
  bottom: "stem_inception1_concat"
  top: "stem_inception2_conv2_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception2_conv2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "stem_inception2_conv2_1_1x1"
  top: "stem_inception2_conv2_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception2_conv2_1_1x1"
  top: "stem_inception2_conv2_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception2_conv2_1_1x1_relu"
  type: "ReLU"
  bottom: "stem_inception2_conv2_1_1x1"
  top: "stem_inception2_conv2_1_1x1"
}
layer {
  name: "stem_inception2_conv2_2_7x1"
  type: "Convolution"
  bottom: "stem_inception2_conv2_1_1x1"
  top: "stem_inception2_conv2_2_7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception2_conv2_2_7x1_bn"
  type: "BatchNorm"
  bottom: "stem_inception2_conv2_2_7x1"
  top: "stem_inception2_conv2_2_7x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception2_conv2_2_7x1"
  top: "stem_inception2_conv2_2_7x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception2_conv2_2_7x1_relu"
  type: "ReLU"
  bottom: "stem_inception2_conv2_2_7x1"
  top: "stem_inception2_conv2_2_7x1"
}
layer {
  name: "stem_inception2_conv2_3_1x7"
  type: "Convolution"
  bottom: "stem_inception2_conv2_2_7x1"
  top: "stem_inception2_conv2_3_1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception2_conv2_3_1x7_bn"
  type: "BatchNorm"
  bottom: "stem_inception2_conv2_3_1x7"
  top: "stem_inception2_conv2_3_1x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception2_conv2_3_1x7"
  top: "stem_inception2_conv2_3_1x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception2_conv2_3_1x7_relu"
  type: "ReLU"
  bottom: "stem_inception2_conv2_3_1x7"
  top: "stem_inception2_conv2_3_1x7"
}
layer {
  name: "stem_inception2_conv2_4_3x3"
  type: "Convolution"
  bottom: "stem_inception2_conv2_3_1x7"
  top: "stem_inception2_conv2_4_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception2_conv2_4_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_inception2_conv2_4_3x3"
  top: "stem_inception2_conv2_4_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception2_conv2_4_3x3"
  top: "stem_inception2_conv2_4_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception2_conv2_4_3x3_relu"
  type: "ReLU"
  bottom: "stem_inception2_conv2_4_3x3"
  top: "stem_inception2_conv2_4_3x3"
}
layer {
  name: "stem_inception2_concat"
  type: "Concat"
  bottom: "stem_inception2_conv1_2_3x3"
  bottom: "stem_inception2_conv2_4_3x3"
  top: "stem_inception2_concat"
}
layer {
  name: "stem_inception3_conv_3x3"
  type: "Convolution"
  bottom: "stem_inception2_concat"
  top: "stem_inception3_conv_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "stem_inception3_conv_3x3_bn"
  type: "BatchNorm"
  bottom: "stem_inception3_conv_3x3"
  top: "stem_inception3_conv_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "stem_inception3_conv_3x3"
  top: "stem_inception3_conv_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "stem_inception3_conv_3x3_relu"
  type: "ReLU"
  bottom: "stem_inception3_conv_3x3"
  top: "stem_inception3_conv_3x3"
}
layer {
  name: "stem_inception3_pool"
  type: "Pooling"
  bottom: "stem_inception2_concat"
  top: "stem_inception3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "stem_inception3_concat"
  type: "Concat"
  bottom: "stem_inception3_conv_3x3"
  bottom: "stem_inception3_pool"
  top: "stem_inception3_concat"
}
layer {
  name: "inception_a1_pool"
  type: "Pooling"
  bottom: "stem_inception3_concat"
  top: "inception_a1_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_a1_conv1_1_1x1"
  type: "Convolution"
  bottom: "inception_a1_pool"
  top: "inception_a1_conv1_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv1_1_1x1"
  top: "inception_a1_conv1_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv1_1_1x1"
  top: "inception_a1_conv1_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv1_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a1_conv1_1_1x1"
  top: "inception_a1_conv1_1_1x1"
}
layer {
  name: "inception_a1_conv2_1_1x1"
  type: "Convolution"
  bottom: "stem_inception3_concat"
  top: "inception_a1_conv2_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv2_1_1x1"
  top: "inception_a1_conv2_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv2_1_1x1"
  top: "inception_a1_conv2_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv2_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a1_conv2_1_1x1"
  top: "inception_a1_conv2_1_1x1"
}
layer {
  name: "inception_a1_conv3_1_1x1"
  type: "Convolution"
  bottom: "stem_inception3_concat"
  top: "inception_a1_conv3_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv3_1_1x1"
  top: "inception_a1_conv3_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv3_1_1x1"
  top: "inception_a1_conv3_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv3_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a1_conv3_1_1x1"
  top: "inception_a1_conv3_1_1x1"
}
layer {
  name: "inception_a1_conv3_2_3x3"
  type: "Convolution"
  bottom: "inception_a1_conv3_1_1x1"
  top: "inception_a1_conv3_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv3_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv3_2_3x3"
  top: "inception_a1_conv3_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv3_2_3x3"
  top: "inception_a1_conv3_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv3_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a1_conv3_2_3x3"
  top: "inception_a1_conv3_2_3x3"
}
layer {
  name: "inception_a1_conv4_1_1x1"
  type: "Convolution"
  bottom: "stem_inception3_concat"
  top: "inception_a1_conv4_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv4_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv4_1_1x1"
  top: "inception_a1_conv4_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv4_1_1x1"
  top: "inception_a1_conv4_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv4_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a1_conv4_1_1x1"
  top: "inception_a1_conv4_1_1x1"
}
layer {
  name: "inception_a1_conv4_2_3x3"
  type: "Convolution"
  bottom: "inception_a1_conv4_1_1x1"
  top: "inception_a1_conv4_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv4_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv4_2_3x3"
  top: "inception_a1_conv4_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv4_2_3x3"
  top: "inception_a1_conv4_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv4_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a1_conv4_2_3x3"
  top: "inception_a1_conv4_2_3x3"
}
layer {
  name: "inception_a1_conv4_3_3x3"
  type: "Convolution"
  bottom: "inception_a1_conv4_2_3x3"
  top: "inception_a1_conv4_3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a1_conv4_3_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a1_conv4_3_3x3"
  top: "inception_a1_conv4_3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a1_conv4_3_3x3"
  top: "inception_a1_conv4_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a1_conv4_3_3x3_relu"
  type: "ReLU"
  bottom: "inception_a1_conv4_3_3x3"
  top: "inception_a1_conv4_3_3x3"
}
layer {
  name: "inception_a1_concat"
  type: "Concat"
  bottom: "inception_a1_conv1_1_1x1"
  bottom: "inception_a1_conv2_1_1x1"
  bottom: "inception_a1_conv3_2_3x3"
  bottom: "inception_a1_conv4_3_3x3"
  top: "inception_a1_concat"
}
layer {
  name: "inception_a2_pool"
  type: "Pooling"
  bottom: "inception_a1_concat"
  top: "inception_a2_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_a2_conv1_1_1x1"
  type: "Convolution"
  bottom: "inception_a2_pool"
  top: "inception_a2_conv1_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv1_1_1x1"
  top: "inception_a2_conv1_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv1_1_1x1"
  top: "inception_a2_conv1_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv1_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a2_conv1_1_1x1"
  top: "inception_a2_conv1_1_1x1"
}
layer {
  name: "inception_a2_conv2_1_1x1"
  type: "Convolution"
  bottom: "inception_a1_concat"
  top: "inception_a2_conv2_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv2_1_1x1"
  top: "inception_a2_conv2_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv2_1_1x1"
  top: "inception_a2_conv2_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv2_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a2_conv2_1_1x1"
  top: "inception_a2_conv2_1_1x1"
}
layer {
  name: "inception_a2_conv3_1_1x1"
  type: "Convolution"
  bottom: "inception_a1_concat"
  top: "inception_a2_conv3_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv3_1_1x1"
  top: "inception_a2_conv3_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv3_1_1x1"
  top: "inception_a2_conv3_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv3_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a2_conv3_1_1x1"
  top: "inception_a2_conv3_1_1x1"
}
layer {
  name: "inception_a2_conv3_2_3x3"
  type: "Convolution"
  bottom: "inception_a2_conv3_1_1x1"
  top: "inception_a2_conv3_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv3_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv3_2_3x3"
  top: "inception_a2_conv3_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv3_2_3x3"
  top: "inception_a2_conv3_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv3_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a2_conv3_2_3x3"
  top: "inception_a2_conv3_2_3x3"
}
layer {
  name: "inception_a2_conv4_1_1x1"
  type: "Convolution"
  bottom: "inception_a1_concat"
  top: "inception_a2_conv4_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv4_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv4_1_1x1"
  top: "inception_a2_conv4_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv4_1_1x1"
  top: "inception_a2_conv4_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv4_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a2_conv4_1_1x1"
  top: "inception_a2_conv4_1_1x1"
}
layer {
  name: "inception_a2_conv4_2_3x3"
  type: "Convolution"
  bottom: "inception_a2_conv4_1_1x1"
  top: "inception_a2_conv4_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv4_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv4_2_3x3"
  top: "inception_a2_conv4_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv4_2_3x3"
  top: "inception_a2_conv4_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv4_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a2_conv4_2_3x3"
  top: "inception_a2_conv4_2_3x3"
}
layer {
  name: "inception_a2_conv4_3_3x3"
  type: "Convolution"
  bottom: "inception_a2_conv4_2_3x3"
  top: "inception_a2_conv4_3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a2_conv4_3_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a2_conv4_3_3x3"
  top: "inception_a2_conv4_3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a2_conv4_3_3x3"
  top: "inception_a2_conv4_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a2_conv4_3_3x3_relu"
  type: "ReLU"
  bottom: "inception_a2_conv4_3_3x3"
  top: "inception_a2_conv4_3_3x3"
}
layer {
  name: "inception_a2_concat"
  type: "Concat"
  bottom: "inception_a2_conv1_1_1x1"
  bottom: "inception_a2_conv2_1_1x1"
  bottom: "inception_a2_conv3_2_3x3"
  bottom: "inception_a2_conv4_3_3x3"
  top: "inception_a2_concat"
}
layer {
  name: "inception_a3_pool"
  type: "Pooling"
  bottom: "inception_a2_concat"
  top: "inception_a3_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_a3_conv1_1_1x1"
  type: "Convolution"
  bottom: "inception_a3_pool"
  top: "inception_a3_conv1_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv1_1_1x1"
  top: "inception_a3_conv1_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv1_1_1x1"
  top: "inception_a3_conv1_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv1_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a3_conv1_1_1x1"
  top: "inception_a3_conv1_1_1x1"
}
layer {
  name: "inception_a3_conv2_1_1x1"
  type: "Convolution"
  bottom: "inception_a2_concat"
  top: "inception_a3_conv2_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv2_1_1x1"
  top: "inception_a3_conv2_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv2_1_1x1"
  top: "inception_a3_conv2_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv2_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a3_conv2_1_1x1"
  top: "inception_a3_conv2_1_1x1"
}
layer {
  name: "inception_a3_conv3_1_1x1"
  type: "Convolution"
  bottom: "inception_a2_concat"
  top: "inception_a3_conv3_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv3_1_1x1"
  top: "inception_a3_conv3_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv3_1_1x1"
  top: "inception_a3_conv3_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv3_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a3_conv3_1_1x1"
  top: "inception_a3_conv3_1_1x1"
}
layer {
  name: "inception_a3_conv3_2_3x3"
  type: "Convolution"
  bottom: "inception_a3_conv3_1_1x1"
  top: "inception_a3_conv3_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv3_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv3_2_3x3"
  top: "inception_a3_conv3_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv3_2_3x3"
  top: "inception_a3_conv3_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv3_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a3_conv3_2_3x3"
  top: "inception_a3_conv3_2_3x3"
}
layer {
  name: "inception_a3_conv4_1_1x1"
  type: "Convolution"
  bottom: "inception_a2_concat"
  top: "inception_a3_conv4_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv4_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv4_1_1x1"
  top: "inception_a3_conv4_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv4_1_1x1"
  top: "inception_a3_conv4_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv4_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a3_conv4_1_1x1"
  top: "inception_a3_conv4_1_1x1"
}
layer {
  name: "inception_a3_conv4_2_3x3"
  type: "Convolution"
  bottom: "inception_a3_conv4_1_1x1"
  top: "inception_a3_conv4_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv4_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv4_2_3x3"
  top: "inception_a3_conv4_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv4_2_3x3"
  top: "inception_a3_conv4_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv4_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a3_conv4_2_3x3"
  top: "inception_a3_conv4_2_3x3"
}
layer {
  name: "inception_a3_conv4_3_3x3"
  type: "Convolution"
  bottom: "inception_a3_conv4_2_3x3"
  top: "inception_a3_conv4_3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a3_conv4_3_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a3_conv4_3_3x3"
  top: "inception_a3_conv4_3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a3_conv4_3_3x3"
  top: "inception_a3_conv4_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a3_conv4_3_3x3_relu"
  type: "ReLU"
  bottom: "inception_a3_conv4_3_3x3"
  top: "inception_a3_conv4_3_3x3"
}
layer {
  name: "inception_a3_concat"
  type: "Concat"
  bottom: "inception_a3_conv1_1_1x1"
  bottom: "inception_a3_conv2_1_1x1"
  bottom: "inception_a3_conv3_2_3x3"
  bottom: "inception_a3_conv4_3_3x3"
  top: "inception_a3_concat"
}
layer {
  name: "inception_a4_pool"
  type: "Pooling"
  bottom: "inception_a3_concat"
  top: "inception_a4_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_a4_conv1_1_1x1"
  type: "Convolution"
  bottom: "inception_a4_pool"
  top: "inception_a4_conv1_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv1_1_1x1"
  top: "inception_a4_conv1_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv1_1_1x1"
  top: "inception_a4_conv1_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv1_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a4_conv1_1_1x1"
  top: "inception_a4_conv1_1_1x1"
}
layer {
  name: "inception_a4_conv2_1_1x1"
  type: "Convolution"
  bottom: "inception_a3_concat"
  top: "inception_a4_conv2_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv2_1_1x1"
  top: "inception_a4_conv2_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv2_1_1x1"
  top: "inception_a4_conv2_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv2_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a4_conv2_1_1x1"
  top: "inception_a4_conv2_1_1x1"
}
layer {
  name: "inception_a4_conv3_1_1x1"
  type: "Convolution"
  bottom: "inception_a3_concat"
  top: "inception_a4_conv3_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv3_1_1x1"
  top: "inception_a4_conv3_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv3_1_1x1"
  top: "inception_a4_conv3_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv3_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a4_conv3_1_1x1"
  top: "inception_a4_conv3_1_1x1"
}
layer {
  name: "inception_a4_conv3_2_3x3"
  type: "Convolution"
  bottom: "inception_a4_conv3_1_1x1"
  top: "inception_a4_conv3_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv3_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv3_2_3x3"
  top: "inception_a4_conv3_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv3_2_3x3"
  top: "inception_a4_conv3_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv3_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a4_conv3_2_3x3"
  top: "inception_a4_conv3_2_3x3"
}
layer {
  name: "inception_a4_conv4_1_1x1"
  type: "Convolution"
  bottom: "inception_a3_concat"
  top: "inception_a4_conv4_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv4_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv4_1_1x1"
  top: "inception_a4_conv4_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv4_1_1x1"
  top: "inception_a4_conv4_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv4_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_a4_conv4_1_1x1"
  top: "inception_a4_conv4_1_1x1"
}
layer {
  name: "inception_a4_conv4_2_3x3"
  type: "Convolution"
  bottom: "inception_a4_conv4_1_1x1"
  top: "inception_a4_conv4_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv4_2_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv4_2_3x3"
  top: "inception_a4_conv4_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv4_2_3x3"
  top: "inception_a4_conv4_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv4_2_3x3_relu"
  type: "ReLU"
  bottom: "inception_a4_conv4_2_3x3"
  top: "inception_a4_conv4_2_3x3"
}
layer {
  name: "inception_a4_conv4_3_3x3"
  type: "Convolution"
  bottom: "inception_a4_conv4_2_3x3"
  top: "inception_a4_conv4_3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_a4_conv4_3_3x3_bn"
  type: "BatchNorm"
  bottom: "inception_a4_conv4_3_3x3"
  top: "inception_a4_conv4_3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_a4_conv4_3_3x3"
  top: "inception_a4_conv4_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_a4_conv4_3_3x3_relu"
  type: "ReLU"
  bottom: "inception_a4_conv4_3_3x3"
  top: "inception_a4_conv4_3_3x3"
}
layer {
  name: "inception_a4_concat"
  type: "Concat"
  bottom: "inception_a4_conv1_1_1x1"
  bottom: "inception_a4_conv2_1_1x1"
  bottom: "inception_a4_conv3_2_3x3"
  bottom: "inception_a4_conv4_3_3x3"
  top: "inception_a4_concat"
}
layer {
  name: "reduction_a_pool"
  type: "Pooling"
  bottom: "inception_a4_concat"
  top: "reduction_a_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "reduction_a_conv2_1_3x3"
  type: "Convolution"
  bottom: "inception_a4_concat"
  top: "reduction_a_conv2_1_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "reduction_a_conv2_1_3x3_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv2_1_3x3"
  top: "reduction_a_conv2_1_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "reduction_a_conv2_1_3x3"
  top: "reduction_a_conv2_1_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "reduction_a_conv2_1_3x3_relu"
  type: "ReLU"
  bottom: "reduction_a_conv2_1_3x3"
  top: "reduction_a_conv2_1_3x3"
}
layer {
  name: "reduction_a_conv3_1_1x1"
  type: "Convolution"
  bottom: "inception_a4_concat"
  top: "reduction_a_conv3_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "reduction_a_conv3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv3_1_1x1"
  top: "reduction_a_conv3_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "reduction_a_conv3_1_1x1"
  top: "reduction_a_conv3_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "reduction_a_conv3_1_1x1_relu"
  type: "ReLU"
  bottom: "reduction_a_conv3_1_1x1"
  top: "reduction_a_conv3_1_1x1"
}
layer {
  name: "reduction_a_conv3_2_3x3"
  type: "Convolution"
  bottom: "reduction_a_conv3_1_1x1"
  top: "reduction_a_conv3_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "reduction_a_conv3_2_3x3_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv3_2_3x3"
  top: "reduction_a_conv3_2_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "reduction_a_conv3_2_3x3"
  top: "reduction_a_conv3_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "reduction_a_conv3_2_3x3_relu"
  type: "ReLU"
  bottom: "reduction_a_conv3_2_3x3"
  top: "reduction_a_conv3_2_3x3"
}
layer {
  name: "reduction_a_conv3_3_3x3"
  type: "Convolution"
  bottom: "reduction_a_conv3_2_3x3"
  top: "reduction_a_conv3_3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "reduction_a_conv3_3_3x3_bn"
  type: "BatchNorm"
  bottom: "reduction_a_conv3_3_3x3"
  top: "reduction_a_conv3_3_3x3"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "reduction_a_conv3_3_3x3"
  top: "reduction_a_conv3_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "reduction_a_conv3_3_3x3_relu"
  type: "ReLU"
  bottom: "reduction_a_conv3_3_3x3"
  top: "reduction_a_conv3_3_3x3"
}
layer {
  name: "reduction_a_concat"
  type: "Concat"
  bottom: "reduction_a_pool"
  bottom: "reduction_a_conv2_1_3x3"
  bottom: "reduction_a_conv3_3_3x3"
  top: "reduction_a_concat"
}
layer {
  name: "inception_b1_pool"
  type: "Pooling"
  bottom: "reduction_a_concat"
  top: "inception_b1_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_b1_conv1_1_1x1"
  type: "Convolution"
  bottom: "inception_b1_pool"
  top: "inception_b1_conv1_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv1_1_1x1"
  top: "inception_b1_conv1_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv1_1_1x1"
  top: "inception_b1_conv1_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv1_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_b1_conv1_1_1x1"
  top: "inception_b1_conv1_1_1x1"
}
layer {
  name: "inception_b1_conv2_1_1x1"
  type: "Convolution"
  bottom: "reduction_a_concat"
  top: "inception_b1_conv2_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv2_1_1x1"
  top: "inception_b1_conv2_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv2_1_1x1"
  top: "inception_b1_conv2_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv2_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_b1_conv2_1_1x1"
  top: "inception_b1_conv2_1_1x1"
}
layer {
  name: "inception_b1_conv3_1_1x1"
  type: "Convolution"
  bottom: "reduction_a_concat"
  top: "inception_b1_conv3_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv3_1_1x1"
  top: "inception_b1_conv3_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv3_1_1x1"
  top: "inception_b1_conv3_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv3_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_b1_conv3_1_1x1"
  top: "inception_b1_conv3_1_1x1"
}
layer {
  name: "inception_b1_conv3_2_1x7"
  type: "Convolution"
  bottom: "inception_b1_conv3_1_1x1"
  top: "inception_b1_conv3_2_1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv3_2_1x7_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv3_2_1x7"
  top: "inception_b1_conv3_2_1x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv3_2_1x7"
  top: "inception_b1_conv3_2_1x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv3_2_1x7_relu"
  type: "ReLU"
  bottom: "inception_b1_conv3_2_1x7"
  top: "inception_b1_conv3_2_1x7"
}
layer {
  name: "inception_b1_conv3_3_1x7"
  type: "Convolution"
  bottom: "inception_b1_conv3_2_1x7"
  top: "inception_b1_conv3_3_1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv3_3_1x7_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv3_3_1x7"
  top: "inception_b1_conv3_3_1x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv3_3_1x7"
  top: "inception_b1_conv3_3_1x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv3_3_1x7_relu"
  type: "ReLU"
  bottom: "inception_b1_conv3_3_1x7"
  top: "inception_b1_conv3_3_1x7"
}
layer {
  name: "inception_b1_conv4_1_1x1"
  type: "Convolution"
  bottom: "reduction_a_concat"
  top: "inception_b1_conv4_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv4_1_1x1_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv4_1_1x1"
  top: "inception_b1_conv4_1_1x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv4_1_1x1"
  top: "inception_b1_conv4_1_1x1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv4_1_1x1_relu"
  type: "ReLU"
  bottom: "inception_b1_conv4_1_1x1"
  top: "inception_b1_conv4_1_1x1"
}
layer {
  name: "inception_b1_conv4_2_1x7"
  type: "Convolution"
  bottom: "inception_b1_conv4_1_1x1"
  top: "inception_b1_conv4_2_1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv4_2_1x7_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv4_2_1x7"
  top: "inception_b1_conv4_2_1x7"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
  bottom: "inception_b1_conv4_2_1x7"
  top: "inception_b1_conv4_2_1x7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "inception_b1_conv4_2_1x7_relu"
  type: "ReLU"
  bottom: "inception_b1_conv4_2_1x7"
  top: "inception_b1_conv4_2_1x7"
}
layer {
  name: "inception_b1_conv4_3_7x1"
  type: "Convolution"
  bottom: "inception_b1_conv4_2_1x7"
  top: "inception_b1_conv4_3_7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_b1_conv4_3_7x1_bn"
  type: "BatchNorm"
  bottom: "inception_b1_conv4_3_7x1"
  top: "inception_b1_conv4_3_7x1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  type: "Scale"
